Tekla Open API Reference for Tekla Structures 2025
InputDefinition Constructor
Overload List
Name | Description
PluginBase.InputDefinition(ArrayList)
 Creates a new input definition instance with multiple point or identifier instances.
PluginBase.InputDefinition(Identifier)
 Creates a new input definition instance with one identifier.
PluginBase.InputDefinition(Point)
 Creates a new input definition instance with one point.
PluginBase.InputDefinition(Point, Point)
 Creates a new input definition instance with two points.
Top
See Also
Reference
PluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace